In [1]:
import pandas as pd
import numpy as np

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [9]:
data = pd.read_excel("test_data.xlsx")

In [14]:
data.shape

(525461, 8)

In [19]:
df = data.iloc[125400 :129401]

In [20]:
df.shape

(4001, 8)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4001 entries, 125400 to 129400
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Invoice      4001 non-null   object
 1   StockCode    4001 non-null   object
 2   Description  3996 non-null   object
 3   Quantity     4001 non-null   int64
 4   InvoiceDate  4001 non-null   datetime64[ns]
 5   Price        4001 non-null   float64
 6   Customer ID  3336 non-null   float64
 7   Country      4001 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 250.2+ KB

In [25]:
df = df.dropna()

In [28]:
df.nunique()

Invoice         185
StockCode      1247
Description    1248
Quantity         77
InvoiceDate     175
Price            84
Customer ID     151
Country           6
dtype: int64

In [51]:
df.groupby("Country")['Invoice'].nunique().sort_values(ascending = False)

Country
United Kingdom    170
Germany             8
EIRE                3
Sweden              2
Denmark             1
France              1
Name: Invoice, dtype: int64

In [53]:
df["Total Price"] = df['Price'] * df["Quantity"]

/var/folders/5d/5_dh0l5x1blftp0m7ykpn2080000gn/T/ipykernel_71973/3326246122.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Total Price"] = df['Price'] * df["Quantity"]

In [54]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Total Price
125400,501347,84991,60 TEATIME FAIRY CAKE CASES,24,2010-03-16 10:51:00,0.55,14873.0,United Kingdom,13.20
125401,501347,21843,RETRO SPOT CAKE STAND,2,2010-03-16 10:51:00,10.95,14873.0,United Kingdom,21.90
125402,501347,21527,RETRO SPOT TRADITIONAL TEAPOT,2,2010-03-16 10:51:00,7.95,14873.0,United Kingdom,15.90
125403,501347,21662,VINTAGE GLASS COFFEE CADDY,3,2010-03-16 10:51:00,5.95,14873.0,United Kingdom,17.85
125404,501347,21663,VINTAGE GLASS SUGAR CADDY,3,2010-03-16 10:51:00,5.95,14873.0,United Kingdom,17.85

In [60]:
df['Total Price'].max()

1296.0

In [63]:
df[df['Total Price'] == 1296.0]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Total Price
127166,501534,21099,SET/6 STRAWBERRY PAPER CUPS,12960,2010-03-17 13:09:00,0.1,13902.0,Denmark,1296.0
127168,501534,21091,SET/6 WOODLAND PAPER PLATES,12960,2010-03-17 13:09:00,0.1,13902.0,Denmark,1296.0

In [68]:
df.groupby('Customer ID')["Total Price"].sum().sort_values(ascending = False)

Customer ID
13902.0    6866.30
13694.0    5879.67
18102.0    4580.00
17511.0    4478.12
12709.0    2917.76
            ...
15058.0     -32.85
18094.0     -38.60
17477.0     -41.65
15057.0     -71.40
16943.0    -241.38
Name: Total Price, Length: 151, dtype: float64

In [75]:
df[df["Customer ID"] == 13694.0].shape

(26, 9)